<template>
    <div class="privacy">
        <p class="title"><strong>《章鱼帝隐私政策》</strong></p>
        <p>本软件尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本软件会按照本隐私权政策的规定使用和披露您的个人信息。但本软件将以高度的勤勉、审慎义务对待这些信息。</p>
        <p>除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三方提供。本软件会不时更新本隐私权政策。</p>
        <p>您在同意本软件服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本软件服务使用协议不可分割的一部分。</p>
        <p><strong>1. 我们如何搜集您的信息？</strong></p>
        <p>我们提供服务时，可能会收集、储存和使用下列信息：</p>
        <p>1.1 您提供的信息</p>
        <p>(1)您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如您的电子电话号码等信息。如果您想充分使用我们提供的各种分享功能，可能还需要创建公开显示的个人资料，其中可能会包含您的姓名和照片</p>
        <p>(2)您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时上传、提交、存储、发送或接收的信息。</p>
        <p>1.2 您在使用服务过程中，我们获取的信息</p>
        <p>我们会收集您使用的服务以及使用方式的信息，此类信息包括：</p>
        <p>(1)设备信息：我们会收集设备专用的信息，例如您的硬件型号、操作系统信息、移动设备版本、设备识别码、屏幕分辨率等信息。</p>
        <p>(2)日志信息</p>
        <p>A.设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；</p>
        <p>B.在使用我们服务时搜索或浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面URL地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；</p>
        <p>(3)IP地址</p>
        <p>A. 有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；</p>
        <p>B. 您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。</p>
        <p><strong>2. 我们如何使用您的信息</strong></p>
        <p>我们可能将上述收集的信息用作以下用途：</p>
        <p>(1)向您提供服务；</p>
        <p>(2)在我们提供服务时，用于身份验证、客户服务、安全防范、存档和备份用途，确保我们向您提供的产品和服务的安全性；</p>
        <p>(3)帮助我们设计新服务，改善我们现有服务；</p>
        <p>(4)使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；</p>
        <p>(5)向您提供与您更加相关的广告以替代普遍投放的广告；</p>
        <p>(6)执行软件验证、升级服务；</p>
        <p>(7)应用户特殊要求而提供特定服务时，需要将信息提供给我们的关联公司、第三方或其他用户；</p>
        <p>(8)其他有利于用户和App运营者利益且不违反任何强制性法律法规的情况。</p>
        <p>(9)让您参与有关我们产品和服务的调查</p>
        <p><strong>3. 我们承诺</strong></p>
        <p>(1)我们不会根据敏感类别（例如种族、宗教、性取向或健康状况）向您展示个性化广告；</p>
        <p>(2)我们不会与广告主分享可用于识别您个人身份的信息，例如您的姓名（除非经您授权同意）；</p>
        <p>(3)在任何时候、任何情况下都不会向任何第三方出售您的个人信息，我们只会在法律允许的范围内使用根据本协议获得的信息。我们会制定严格的政策保护您的个人信息，除非事先获得您的授权或本声明另有规定之外，不会将您的这些信息对外公开或向第三方提供。</p>
        <p><strong>4. 我们不会将您的个人信息转移或披露给任何非关联的第三方，除非：</strong></p>
        <p>(1)相关法律法规、法律程序、政府机关的强制性要求；</p>
        <p>(2)为完成合并、分立、收购或资产转让而转移；</p>
        <p>(3)事先获得您的授权；</p>
        <p>(4)您使用共享功能；</p>
        <p>(5)以学术研究或公共利益为目的；</p>
        <p>(6)在法律法规和政策允许的范围内，为提升用户体验和提供个性化的推广服务；</p>
        <p>(7)我们认为必要且不违反法律强制性规定的其他情形。</p>
        <p><strong>5.除非经过您的同意，否则我们不会向任何人提供您的敏感个人信息。</strong></p>
        <p><strong>6.信息存储和交换</strong></p>
        <p>本软件收集的有关您的信息和资料将保存在本软件及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本软件收集信息和资料所在地的境外并在境外被访问、存储和展示。</p>
        <p><strong>7.我们如何保护您的个人信息</strong></p>
        <p>我们制定了严格的信息管理政策，配备专业的技术团队，采取了一系列合理的预防措施，以保护您的个人信息不会遭受未经授权的浏览、披露、滥用、变更、破坏以及损失，</p>
        <p><strong>8.您分享的信息</strong></p>
        <p>我们会提供网络服务，您在使用这一类型服务时，您所上传或发布的信息、您对他人上传或发布的信息作出的回应，以及与这些信息有关的日志信息等，只要您不删除这些信息，它们会一直留存在公共领域，并被使用我们服务的其他用户分享、浏览。</p>
        <p>即使您删除这些信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或第三方在公共领域保存。</p>
        <p>请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。</p>
        <p><strong>9.本政策的更新</strong></p>
        <p>我们可能会不定期修改、更新本隐私政策，有关隐私政策的更新，我们会在网页以及App中以通知公告等形式发布，您可以访问网页以及App查询最新版本的隐私政策。</p>
    </div>
</template>

<script>
    export default {
        
    }
</script>

<style scoped lang='scss'>
    .privacy{
        padding: 10px 15px;
        .title{
            text-align: center;
        }
        p{
            text-indent:2em;
            margin: 0;
            line-height: 2;
            font-size: 12px;
            strong{
                font-size: 14px;
            }
        } 
    }
    
</style>